CREATE TABLE atlas_driver_offer_bpp.disability_type (
  tag character varying(255) NOT NULL,
  language character varying(255) NOT NULL,
  on_booking_message character varying(255) NOT NULL,
  on_arrival_message character varying(255) NOT NULL,
  on_ride_start_message character varying(255) NOT NULL,
  CONSTRAINT disability_type_pkey PRIMARY KEY (tag, language)
);

INSERT INTO atlas_driver_offer_bpp.disability_type (tag, language, on_booking_message, on_arrival_message, on_ride_start_message)
VALUES ('BLIND_LOW_VISION', 'ENGLISH', 'Customer has poor vision. Please call and avoid chats', 'Customer has poor vision. Sound horn once at pickup', 'Customer has poor vision. Please help them as you can'),
       ('BLIND_LOW_VISION','HINDI', 'ग्राहक की दृष्टि कमजोर है। कृपया उन्हें चैट की बजाय कॉल करें।', 'ग्राहक की दृष्टि कमजोर है। कृपया पिकअप पर एक बार हॉर्न बजाएं।', 'ग्राहक की दृष्टि कमजोर है। जैसे आप मदद कर सकते हैं, कृपया करें'),
       ('BLIND_LOW_VISION','TAMIL', 'வாடிக்கையாளருக்கு மோசமான பார்வை உள்ளது. தயவுசெய்து அழைக்கவும், அரட்டைகளைத் தவிர்க்கவும்', 'வாடிக்கையாளருக்கு மோசமான பார்வை உள்ளது. பிக்அப் செய்யும் போது ஒருமுறை ஹார்ன் அடிக்கவும்', 'வாடிக்கையாளருக்கு மோசமான பார்வை உள்ளது. தங்களால் இயன்ற உதவி அவர்களுக்கு உதவுங்கள்'),
       ('BLIND_LOW_VISION','MALAYALAM', 'ഗ്രാഹകൻ വീക്ഷണം കുറഞ്ഞതുമായിരിക്കുന്നു. ചാറ്റ് ചെയ്യുക മാത്രം അല്ലെങ്കിൽ അവരെ വിളിക്കുക.', 'ഗ്രാഹകൻ വീക്ഷണം കുറഞ്ഞതുമായിരിക്കുന്നു. പിക്കപ്പ് സ്ഥലത്ത് ഒരാഴ്ച്ച ഹോൺ കൊടുക.', 'ഗ്രാഹകൻ വീക്ഷണം കുറഞ്ഞതുമായിരിക്കുന്നു. ദയവായി അവരെ സഹായിക്കുക എന്തുകൊണ്ടെന്ന് നിങ്ങൾ കൊണ്ടുവരുന്നു'),
       ('BLIND_LOW_VISION','KANNADA',  'ಗ್ರಾಹಕನಿಗೆ ದೃಷ್ಟಿ ಸ್ವಲ್ಪ ಕಡಿಮೆಯಿದೆ. ಚಾಟ್ ಮಾಡಿದಂತೆಯೇ ಅಲ್ಲಿ ಕಾಲ್ ಮಾಡಿ.', 'ಗ್ರಾಹಕನಿಗೆ ದೃಷ್ಟಿ ಸ್ವಲ್ಪ ಕಡಿಮೆಯಿದೆ. ಪಿಕಪ್ ನಲ್ಲಿ ಒಮ್ಮೆ ಹಾರ್ನ್ ಮಾಡಿ.', 'ಗ್ರಾಹಕನಿಗೆ ದೃಷ್ಟಿ ಸ್ವಲ್ಪ ಕಡಿಮೆಯಿದೆ. ಸಾಹಾಯ ಮಾಡುವಂತೆ ನೀವು ಸಾಹಾಯಿಸಬಹುದು'),
       ('HEAR_IMPAIRMENT', 'ENGLISH', 'Rider has poor hearing. Please chat and avoid calls', 'Rider has poor hearing. Message them at pickup', 'Rider has poor hearing. Please help them as you can'),
       ('HEAR_IMPAIRMENT', 'HINDI',  'राइडर को कम सुनाई देता है। कृपया उनके साथ चैट करें, कॉल की बजाय।', 'राइडर को कम सुनाई देता है। कृपया पिकअप पर एक बार मैसेज भेजें।', 'राइडर को कम सुनाई देता है। जैसे आप मदद कर सकते हैं, कृपया करें'),
       ('HEAR_IMPAIRMENT', 'TAMIL', 'ரைடருக்கு செவித்திறன் குறைவு. தயவுசெய்து அரட்டையடிக்கவும், அழைப்புகளைத் தவிர்க்கவும்', 'ரைடருக்கு செவித்திறன் குறைவு. பிக்அப்பில் அவர்களுக்கு செய்தி அனுப்பவும்', 'ரைடருக்கு செவித்திறன் குறைவு. தங்களால் இயன்ற உதவி அவர்களுக்கு உதவுங்கள்'),
       ('HEAR_IMPAIRMENT', 'MALAYALAM',  'റൈഡർ ശ്രവണം കുറഞ്ഞതാണ്. അവർക്ക് വിളിക്കുകയോ ചാറ്റ് ചെയ്യുകയോ ചെയ്യുക.', 'റൈഡർ ശ്രവണം കുറഞ്ഞതാണ്. പിക്കപ്പ് സ്ഥലത്ത് ഒരാഴ്ച്ച സന്ദേശം അയയ്ക്കുക.', 'റൈഡർ ശ്രവണം കുറഞ്ഞതാണ്. ദയവായി അവർക്ക് സഹായിക്കുക നിങ്ങൾ എങ്ങനെ സഹായിക്കാനാകുക എന്ന് നിങ്ങളെല്ലാം പരിഗണിക്കുന്നു'),
       ('HEAR_IMPAIRMENT', 'KANNADA',  'ರೈಡರಿಗೆ ಕಿವಿ ಕಡಿಮೆಯಾಗಿದೆ. ಕರೆಯುವ ಬದಲು ಚಾಟ್ ಮಾಡಿ.', 'ರೈಡರಿಗೆ ಕಿವಿ ಕಡಿಮೆಯಾಗಿದೆ. ಪಿಕಪ್ ನಲ್ಲಿ ಒಮ್ಮೆ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸಿ.', 'ರೈಡರಿಗೆ ಕಿವಿ ಕಡಿಮೆಯಾಗಿದೆ. ಸಾಹಾಯ ಮಾಡುವಂತೆ ನೀವು ಸಾಹಾಯಿಸಬಹುದು'),
       ('LOCOMOTOR_DISABILITY', 'ENGLISH', 'Customer has low mobility. Please go to exact pick up', 'Customer has low mobility. Help with their mobility aid', 'Customer has low mobility. Please help them as you can'),
       ('LOCOMOTOR_DISABILITY', 'HINDI',  'राइडर ठीख से चल नहीं पाते। कृपया सटीक पिक अप स्थान पर जाएं।', 'राइडर ठीख से चल नहीं पाते। कृपया उनकी सहायता करें और उनके समर्थनों को पैसेंजर सीट के पीछे रखें।', 'राइडर ठीख से चल नहीं पाते। जैसे आप मदद कर सकते हैं, कृपया करें'),
       ('LOCOMOTOR_DISABILITY', 'TAMIL', 'வாடிக்கையாளருக்கு குறைந்த இயக்கம் உள்ளது. சரியான பிக்-அப்பிற்கு செல்லவும்', 'வாடிக்கையாளருக்கு குறைந்த இயக்கம் உள்ளது. அவர்களின் இயக்கம் உதவிக்கு உதவுங்கள்', 'வாடிக்கையாளருக்கு குறைந்த இயக்கம் உள்ளது. தங்களால் இயன்ற உதவி அவர்களுக்கு உதவுங்கள்'),
       ('LOCOMOTOR_DISABILITY', 'MALAYALAM', 'ഗ്രാഹകൻ കുറഞ്ഞ ചലനം ഉണ്ട്. സ്ഥാനം എങ്ങനെ കൊണ്ടുപോവാമെന്ന് ദയവായി നോക്കുക.', 'ഗ്രാഹകൻ കുറഞ്ഞ ചലനം ഉണ്ട്. ദയവായി അവരുടെ പിന്നിൽ പാസഞ്ചർ സീറ്റിനുള്ളിലേക്ക് അവരുടെ പിന്നാലെ പിന്നെ അവരുടെ പിന്നിലെ സഹായകൾ സൂക്ഷിക്കുക.', 'ഗ്രാഹകൻ കുറഞ്ഞ ചലനം ഉണ്ട്. ദയവായി അവർക്ക് സഹായിക്കുക എന്തെങ്കിൽ നിങ്ങൾ സഹായിക്കാനാകുക'),
       ('LOCOMOTOR_DISABILITY', 'KANNADA', 'ಗ್ರಾಹಕನಿಗೆ ಕಡಿಮೆ ಚಲನೆ ಇದೆ. ಖಚಿತ ಪಿಕಪ್ ಸ್ಥಳಕ್ಕೆ ಹೋಗಿ.', 'ಗ್ರಾಹಕನಿಗೆ ಕಡಿಮೆ ಚಲನೆ ಇದೆ. ಪಿಕಪ್ ನಲ್ಲಿ ಅವರ ಬೈಠಕ್ಕೆ ಮುಂದಿನ ಸ್ಥಾನದಲ್ಲಿ ಅವರ ಬೆಂಬಲಗಳನ್ನು ಸಂರಕ್ಷಿಸಿ.', 'ಗ್ರಾಹಕನಿಗೆ ಕಡಿಮೆ ಚಲನೆ ಇದೆ. ಸಾಹಾಯ ಮಾಡುವಂತೆ ನೀವು ಸಾಹಾಯಿಸಬಹುದು'),
       ('OTHER', 'ENGLISH', 'Customer has a disability. Please assist them as you can.', 'Customer has a disability. Please assist them as you can.', 'Customer has a disability. Please help them as you can'),
       ('OTHER', 'HINDI', 'ग्राहक विकलांग है। कृपया आप जैसे सहाय्य कर सकते हो, करें।', 'ग्राहक विकलांग है। कृपया आप जैसे सहाय्य कर सकते हो, करें।', 'ग्राहक विकलांग है। जैसे आप मदद कर सकते हैं, कृपया करें'),
       ('OTHER', 'TAMIL',  'வாடிக்கையாளருக்கு குறைபாடு உள்ளது. உங்களால் முடிந்தவரை அவர்களுக்கு உதவுங்கள்.', 'வாடிக்கையாளருக்கு குறைபாடு உள்ளது. உங்களால் முடிந்தவரை அவர்களுக்கு உதவுங்கள்.', 'வாடிக்கையாளருக்கு குறைபாடு உள்ளது. உங்களால் முடிந்தவரை அவர்களுக்கு உதவுங்கள்.'),
       ('OTHER', 'MALAYALAM', 'ഗ്രാഹകൻ ഒരു അശരീരത. ദയവായി നിങ്ങൾ സഹായിക്കുക എന്തെങ്കിൽ സഹായിക്കാനാകുക.', 'ഗ്രാഹകൻ ഒരു അശരീരത. ദയവായി നിങ്ങൾ സഹായിക്കുക എന്തെങ്കിൽ സഹായിക്കാനാകുക.', 'ഗ്രാഹകൻ ഒരു അശരീരത. ദയവായി അവരെ സഹായിക്കുക എന്തെങ്കിൽ നിങ്ങൾ സഹായിക്കാനാകുക'),
       ('OTHER', 'KANNADA', 'ಗ್ರಾಹಕನಲ್ಲಿ ಏನೋ ತೊಂದರೆ ಇದೆ. ನೀವು ಸಹಾಯಮಾಡಬಹುದಾಗಿದೆ ತಯಾರಾಗಿರಿ.', 'ಗ್ರಾಹಕನಲ್ಲಿ ಏನೋ ತೊಂದರೆ ಇದೆ. ನೀವು ಸಹಾಯಮಾಡಬಹುದಾಗಿದೆ ತಯಾರಾಗಿರಿ.', 'ಗ್ರಾಹಕನಲ್ಲಿ ಏನೋ ತೊಂದರೆ ಇದೆ. ಸಾಹಾಯ ಮಾಡುವಂತೆ ನೀವು ಸಹಾಯಿಸಬಹುದು');
